OpenFoam_Gasrelease/0/U
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    vent
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    topCap
    {
        type            slip;
    }

    bottom
    {
        type            slip;
    }

    outerWall
    {
        type            slip;
    }

    wedgePlus
    {
        type            wedge;
    }

    wedgeMinus
    {
        type            wedge;
    }

    axis
    {
        type            empty;
    }
}