OpenFoam_Gasrelease/system/fvSchemes
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(U)         Gauss linear;
}

divSchemes
{
    default                             none;

    div(phi,U)                          Gauss limitedLinearV 1;
    div(phi,K)                          Gauss limitedLinear 1;
    div(phi,h)                          Gauss limitedLinear 1;
    div(phid,p)                         Gauss limitedLinear 1;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p;
}